
▼ ps について
-------------------------------------------------
TTY
// 標準入出力先の仮想端末ファイル teletypewriter
// a native terminal device。バックエンドは HW（サーバ上のコンソール） か
// カーネルがエミュレートしているか。

pty
// pseudo terminal device。 ssh など、他のプログラムがエミュレートした端末

? な TTY
// デーモンプロセス。端末制御じゃないから

TIME
// プロセスがCPUを使った時間

CMD
// プロセスの実行コマンド

引数 aux
// 自分以外のユーザープロセス + デーモンプロセス + ユーザー名と開始時刻

VSZ(Virtual Set Size)
// プロセスが確保した仮想メモリ領域のサイズ
// プロセスがメモリ要求を行うとカーネルが依頼を受け、
// 物理メモリを抽象化した仮想メモリのアドレスを返却します。
// プロセスに仮想メモリのアドレスを返却した時点では物理メモリの領域は確保せず、
// プロセスがメモリに書き込みを行ったタイミングで物理メモリを確保します。

RSS(Resident Set Size)
// 物理メモリ領域のサイズ
// 物理メモリが不足した場合には、
// 長時間使われていない仮想メモリと物理メモリ領域の対応を解除する。
// 解除したデータはディスクにスワップ。
// スワップが発生している時、＄SS が高いプロセスが怪しい

-------------------------------------------------



socket
-------------------------------------------------
ネットワーク接続を表す仮想ファイル。
コミュニケーションのロジカルなエンドポイント。
トランスポートレイヤーに属する。
プロトコル、マシーン、ポートごとに異なる。
パケットのヘッダにある。
-------------------------------------------------
