
▼ Import/Export ディスク // depricated
-------------------------------------------------
AWS への/からの 大量のデータの出し入れを行うための、
ポータブルストレージデバイス。
高容量を送受信できるネットワークを使う。
-------------------------------------------------

▼ Snowball 一味
-------------------------------------------------
Glacier を使う場合は S3 経由で。

▼ Snowball
物理的な箱
ペタバイト格納可能。
ネットワークコストとセキュリティ上の問題を解決。
ハイスピードインターネットより 1/5 のお値段になることもある

80TB なら全Region で。
頑丈な箱。AES256暗号化。
データ移行後は、Snowball 内のデータは完全消去。

▼ Snowball Edge
オンプレミスに持ってきて使える、小さな AWS データセンター。
ネットワークアクセスが不確実なエッジロケーションで有用。
ストレージとしてだけでなく、データ処理を行う機能があり、
lambda も使える。

用途例）
旅客機製造メーカーが、これを旅客機内に持ち込んで、
エンジンのデータ処理をしたり、データ収集をしたりしたあとで、
AWS のデータセンターに送る

100TB のデータを AWS
▼ Snowmobile
トラック。1台あたり 100PB 送れる。
エクサバイトのデータを 10mb/sec なラインで AWS に普通に送ろうとしたら
25年かかるところを、snowmobile なら 6ヶ月で可能。
-------------------------------------------------
