▼ Storage Gateway とは
-------------------------------------------------
オンプレミスのソフトウェア アプライアンスと、
クラウド上のストレージとを接続

結果、組織のオンプレミス環境と、AWS のストレージインフラとを
シームレスにかつ、セキュアに繋ぐ

結果、スケーラブルで、コストエフェクティブ にストレージを利用できる
-------------------------------------------------

▼ その種類
-------------------------------------------------
ターミノロジー
・ブロックレベルストレージ
// クラウドストレージが、HD などのブロックデバイスの振る舞いを真似たもの。
// NAS の形をとる// Network Attached Storage
// Storage は ブロックで構成されている。

・オブジェクトストア
// S3 のように、OBJベースで構成されたストレージ

▼ File Gateway(NFS)// Network File System プロトコル
// ローカルファイルと同じように、NW のファイルを使える。
// 指定した ディレクトリをマウントして使うイメージ
// ストレージへのブロックレベルアクセスは提供せず、
// ネットワーク・プロトコルでアクセス
Flat file を OBJ としてS3 に格納
オーナー、アクセス権、タイムスタンプもメタデータとして保存される。
S3 のネイティブOBJ 扱いを受ける。ポリシーやバージョニングやライフサイクルや、
クロスリージョンレプリケーション対象となる

▼ Volumes Gateway(iSCSI)// Internet Small Computer Systems Interface
// あいすかじー
// バーチャルハードディスクみたいなもの
// バーチャルストレージボリュームを作成し、iSCSI を使ってオンプレミスにマウント。
// そこの MySQL などに格納されたデータは、オンプレミスに保存されることになる。
// そしてバックアップもされる。

// IP をもとに、ストレージをネットワーク化する
// iSCSI ブロックプロトコルを使ってディスクボリュームを提供
// TCP/IP の SCSI コマンドを通じてブロックレベルアクセスができる

// OS、VM、MySQL 等も扱うことができる
// オブジェクトベースではないので、S3 ではない。

// Amazon EBS スナップショットに、非同期でバックアップされる
// インクリメンタルバックアップ。圧縮保存されてる。

S3 に全体を非同期でバックアップ。
バックアップは、S3 に EBS形式のスナップショットとして保存（Elastic Block Store)

 - Stored Volumes
 1GB-16TB
 オンプレミスに全テータがある。

 - Cached Volumes
 1TB～32TB
 オンプレミスには、最近アクセスがあったデータだけある。
 結果、オンプレミスのボリュームを最小化。


▼ Tape Gateway（VTL)// virtual tape library
// バックアップと復元に使われる
// 耐久性があり、コストエフェクティブ
// HD 等を、テープライブラリに変換したもの
// S3 に送って、ライフサイクルに従ってGlacier 送りになったりする

// 既存の テープバックアップアプリをiSCSI デバイスとして利用して、
// Tape Gateway に作成した VTカートリッジにデータをバックアップできる
// preConfigured な メディアチェンジャーとテープドライブを使って、バックアップ
-------------------------------------------------
