enumerate
 → 列挙型は tuple のリストを返す
-------------------------------------------------
list(enumerate('abcde'))
-------------------------------------------------


enumerate のインデックスと要素とを出力
-------------------------------------------------
# tuple がアンパックされる

for i,letter in enumerate('abcde'):
    print("At index {} the letter is {}".format(i,letter))
-------------------------------------------------


▼ ZIP
 →2つのリストの要素を、tuple ペアのリストに変換
-------------------------------------------------
mylist1 = [1,2,3,4,5]
mylist2 = ['a','b','c','d','e']
list(zip(mylist1,mylist2))
-------------------------------------------------
