▼ SNS// Simple Notification Service
-------------------------------------------------
・Push ベースで瞬時に配信
・クラウドからの、メッセージ通知のセットアップ、オペレート、送信を行うのに使う
・通知先はサブスクライバーや、他のアプリ
// オートスケーリングした時の、インスタンス作成/削除通知にも使われている
・いろんなトランスポートプロトコルに対応
// スマホアプリ、SMS、Email、SQS キュー、HTTP エンドポイント にも通知
・SNS トピックに、Labbda 機能をサブスクライブできる
// メッセージのペイロードが Lambda を起動。パラメータとして利用できる。
// 他の SNS トピックや AWSサービス にメッセージを送ったりできる
・一つのトピックから複数のエンドポイントへの配信ができる
// iOS, アンドロイド、SMS の受領者をまとめてグループ化できる
・トピックを「アクセスポイント」として扱うことができる
// トピックを使って、同じ通知のアイデンティカルなコピーに、受領者が動的に申し込めるようにする
・トピックに送信すると、SNS はメッセージのコピーをフォーマットして、各サブスクライバーに配信する
・SNS に発信されたメッセージは、ロストを防ぐために複数のAZ に格納される
・0.5ドル/1万リクエスト
0.06$/10万 配信(HTTP)
0.75$/100 配信(SMS)
2$/10万 配信(EMail)
-------------------------------------------------


▼ よくある使いみち
-------------------------------------------------
https://docs.aws.amazon.com/ja_jp/sns/latest/dg/SNS_Scenarios.html
オートスケーリングに使う
cloudWatch と一緒に使う
アラートとして使う
-------------------------------------------------


▼ ラボ
-------------------------------------------------
トピックの作成
// 適当にトピックとか入力

サブスクリプションの作成
// SubscriptionID は Pending →Confirm されると、ID が ARN に変わる
// メールとか適用すると、確認メール →confirm subscription みたいな流れになる
Subscriber 番号

トピックを発行
件名とか、メッセージとか入れるとメールが届くが、
これが Lambda 宛だとどうなるんだ？
