そもそも ロードバランサーとは
-------------------------------------------------

ロードバランサ
・常にヘルスチェックを行っている
・異常があると判断したWebサーバに対しては処理を割り振らず、別の正常なサーバに割り振る

よるある作業例
サーバOS／アプリケーションのパッチ適用やバージョンアップなどに伴い、
サーバをロードバランス対象から切り離す作業

その際に有用な機能
// アプリケーションに対するユーザーセッションが一つ残らず使われていないかをチェックする機能

ロードバランサ自体の冗長化も欠かせない

パーシステンス
Webアプリケーションのトランザクションの整合性を維持するために、
特定のユーザーからのWebアクセスを、ある特定のサーバに割り振り続ける機能

レイヤー7 トラフィック処理
・URIスイッチ
URIの内容に応じて、リクエストを特定のサーバ群に割り振る

何故使うか
// Webサイトでは通常、コンテンツやサービスごとに開発・運用を担当する部門が異なる。
// そこで、個々のコンテンツ／サービスごとにあらかじめ異なるURIを指定しておき、
// その内容を基にユーザーからのリクエストを適切なサーバ群に自動的に割り振ることで、
// 開発や運用体制の独立性を高め効率的なサイト運用をする

SSLオフロード
・複数のWebサーバを運用する場合、個別にSSL証明書を入手・管理・更新する必要がある
これをロードバランサ上で集中管理できる
・暗号化された形で届いたデータの復号化処理の負荷を
Webサーバの代わりに ロードバランサーで引き受ける
-------------------------------------------------






L4 と L7 の違い
-------------------------------------------------
■ロードバランサー(L4)の特徴
// 　・レイヤー4の負荷分散が可能です。（IPアドレスによる負荷分散が可能）
ネットワークは生きているものの、
アプリケーションがダウンしているような障害は検知できない


■ロードバランサー(L7)の特徴
// 　・レイヤー7で負荷分散が可能です。 （URLやHTTPヘッダーで負荷分散が可能）
-------------------------------------------------







ELB 実験方法
-------------------------------------------------
※注意。ELB は有料
つけっぱなしはよくない。
複数だったり、リージョンまたがってたりしたらますますカネがかかる

ping パス に、実験用に作成した /healthcheck.html を指定してやる

実験用なので、素早いレスポンス確認のため以下の値にしておく
// 応答時間 ２ 間隔 ５

ヘルスチェック対象を選択

タグを作成
ProductionELB/ON

ELB の DNS名 にアクセスしてみる
public IP adress は変わるため、DNS名 でアクセスしましょう
// MyClassicELB-1705355779.ap-northeast-1.elb.amazonaws.com
 // ⇒index.html の状態が表示される

状態について
// ターゲットのヘルス状態を表示している

ターゲットの html ファイルを削除
// 指定した確認時間後に、OutOfService になるはず
ファイルを作成し直し
InService になる
-------------------------------------------------
ApplicationELB の場合

成功コードを範囲指定できる
200-299

ターゲットを選択 ⇒登録済みに追加
-------------------------------------------------






▼ その他の Web アクセスの負荷を分散するための機器
-------------------------------------------------
DNSラウンドロビン
// DNSサーバの設定を工夫し、一つのホスト名への名前解決に複数のIPアドレスで応答することでWebサーバへのアクセスを分散
-------------------------------------------------
