4:33 から。


おっしゃってることがわかりかねます。

お休みのところ失礼致しました。

20分後に出頭せよとのことです。

まことにありがとう。

さて。では少将閣下と会ってくる。

言わんとすることはわかる。

率直に申し上げますが

謹んで申し上げますが

ご諮問に対してはこれ以上のことを申し上げうる立場にないと指向いたします。

ご理解いただけましたか。ありがとうございます。

閣下、お言葉ですが

しかし閣下ひとつだけよろしいでしょうか

理解致しました。
では私はこれにて。

それで会議のほうはつつがなく？

残念ながらあまり良くない知らせのようです
申し訳ありませんが、召喚はこれにて中座させていただきたく
無礼のほどご容赦いただきたく思います。では。



▼ そもそも
-------------------------------------------------
現環境がどのような意図で設計されているか把握しておく。
・「なぜ、どうして、その設計/設定なのか」が記載されていることを重要視
・誰がみてもひと目で分かるものを作る

丁寧な書き方
リモートからの root ユーザでの直接ログインは、監視サーバからのみrootアクセスを許可する設計とする。

基本設計書
 →設計方針を伝えるためのドキュメント
詳細設計書
 →基本設計を実設定に落としたドキュメント
 →設計した意図、経緯を記載


パラメータシート
 →設定値を記載するのはパラメータシートのみとする。
 →ドキュメント修正時に修正箇所を増やさないため。
 →備考欄に ○○のため当設定値とする、とあると親切。
-------------------------------------------------





▼ バックアップ設計のための基礎知識
-------------------------------------------------
