▼ AMI と インスタンス
-------------------------------------------------
AMI
・Amazon Machine Image
・ソフトウェア構成 (OS, application, applicationServer) を記録したテンプレート
・AMI から、クラウドで仮想サーバーとして実行される AMI のコピーであるインスタンスを起動
・AMI のルートデバイスは、EBS と インスタンス ストア の2種類がある
・リージョナル。格納されているリージョンからのみ立ち上げることができる。
・他リージョンに AMI をコピーすることは可能



インスタンス
・AMI のコピー
・クラウドで仮想サーバーとして実行される
・同じAMIから、異なるインスタンスタイプのインスタンスを作成できる// M4 とか P2 とか
・インスタンスがエラーで終了した場合は、元の AMI から新しいインスタンスを起動できる
・インスタンス起動後は、普通の ホスト として振る舞う
-------------------------------------------------




▼ EBS ボリューム
-------------------------------------------------
EBS スナップショットを使って作られる

ホストが停止してもデータは失われない。
-------------------------------------------------










▼ インスタンスストアの特徴
-------------------------------------------------
S3 に保存されてるテンプレートから作られる

Ephemeral ストレージとか言われる

サーバを停止できない。
ホストが フェイルしたら、データを失う。
// EBS であれば、ヘルスチェックがおかしい時に停止して起動すれば、
// なんかAmazon内をぐるぐるまわって調子良くなる？的な？事があるらしいが、
// インスタンスストアは再起動しかできず、それだと無理らしい？？

再起動は可能。データは失われない。

昔はすべてがインスタンスストアだった。
// その頃は、VM がおかしくなったらデータが消えたりして
// Amazon は批判されてた
-------------------------------------------------
