▼ キーをコピーしておく
-------------------------------------------------
プログラマティックログインを割り当てたユーザー作成時に
なんとかキー と なんとか秘密キーとをコピーしておく
-------------------------------------------------

どこぞの EC2 にアクセス








▼ aws のコマンドを入力
-------------------------------------------------
// もしかしたら、 AWS CLI をインストールしていないとできないかもしれない

コマンドが通るか確認
// aws s3 ls

configure しろと出たら、する
// aws configure
Default output format は json が読みやすい
-------------------------------------------------







▼ 主な EC2 インスタンスコマンド
-------------------------------------------------
手持ちの EC2 インスタンスの情報を表示
// aws ec2 describe-instances
// terminated も表示される

インスタンスIDを指定して Terminate
// aws ec2 terminate-instances --instance-ids i-056ce732d00c2c8d7
describe-instances だと、下記のキーでみつけられる
// "InstanceId": "i-056ce732d00c2c8d7",
-------------------------------------------------









▼ EC2 インスタンス と IAM とでできること
-------------------------------------------------
EC2 インスタンスにロールを与えると、
その インスタンスにアクセスすれば、そこからそのロールに与えられた権限を行使できる

EC2 に S3 へのアドミンアクセスを与えるとどうなるか
// プログラマティックキーなしで、AWS のリソースにアクセスできる
// よって、とってもセキュア
// S3 へのアクセス権のあるロールを与えれば、下記コマンドが通る
// aws s3 ls

このままだと ~.aws ディレクトリは存在しない
必要であれば、下記の手順で生成できる
// aws configure ⇒キーとかは未入力Enter でOK
//  ⇒~.aws が作成され、config ファイルに 下記のような情報が入力される
//  [default]
// output = json
// region = ap-northeast-1

-------------------------------------------------


▼ S3 CLI と リージョン
-------------------------------------------------
S3 バケツから、EC2 インスタンスへデータをコピー
// aws s3 cp --recursive s3://shivaq-uewest /home/ec2-user
取得先リージョンによっては、下記のようなリージョン指定引数が必要になるらしい
// --region eu-west-2
------------------------------------------------
