
▼ EBS// Elastic Block Storage 伸縮性・弾力性のある
// EC2 にアタッチするストレージ。ディスクみたいなものと思えばいい。
-------------------------------------------------
OBJ ベースの S3 にはできなかった、OS や DB や アプリのインストールができる
// アタッチするとできること
// ・ボリューム上に ファイルシステムを作成
// ・DB を走らせる
// ・その他、ブロックデバイスを使ってできることを色々できる

特定の AZ に配置されて、自動レプリケートされる。
 // ・ストレージアレイがダウンしても、他のストレージアレイにレプリケートされているからダウンしない
 // ・他の AZ には自動レプリケートされない

EBS ボリュームは、複数の EC2 で共有できない。
 // ・共有したい場合は EFS を使いましょう
-------------------------------------------------


▼ スナップショットと EBS
-------------------------------------------------
スナップショットは S3 に格納されている// 可視化はされていないけれども
スナップショットはインクリメンタル

AMI はボリュームからもスナップショットからも作成できる

EBS はダウンタイム無しで VolumeType やサイズを変えられる
// Magnetic(AKA Standard) だけは止めずに変えることはできない
// 事前にスナップショットをとったりも不要
// でも、止めたほうがいいとは思うとのこと

EC2 を異なる AZ で作成
// EC2 作成時に、EC2 と異なる AZ に EBS を作成することはできない。
// EC2 のスナップショットからボリュームを作成した時は、異なる　AZ に変更できる
// 推測ではあるが、EBS が S3 に格納されるから、それをレプリケートしている

EC2 を異なる リージョンで作成
// スナップショットからコピーを作成する時に変更可能

スナップショットが暗号化されていない限り、共有可能
他の AWS アカウントとも共有可能。パブリックにすることも可能


-------------------------------------------------





▼ EBS のボリュームタイプ
-------------------------------------------------
▼ General Purpose SSD(GP2)// solid-state drive。HDD よりめっちゃ速い
・価格と性能のバランスの取れたボリュームタイプ
・3 IOPS/GB ～ 10000 IOPS/GB

▼ Provisioned IOPS SSD(IO1)
・I/O インテンシブなアプリ用にデザインされている。  大きな RDB や NoSQL DB とか。
・10000/IOPS ～ 20000 IOPS

▼ Throuput Optimized HDD(ST1)
・シークエンシャルなデータの処理に向いている
・Big Data、Data Warehousing、Log processing に適している
・ブートドライブにはなれない

▼ Cold HDD(SC1)
・ST1 よりアクセスの少ない workload 用の、低価格ストレージ// 特定の時間内に、ワーカーが行う仕事量
・ファイルサーバ。S3 じゃない理由？アプリがローカルデバイスから読み取りたい場合とか。
・ブートドライブにはなれない

▼ Magnetic HDD(Standard)
・最安値/GB
・ブートドライブになれる
・アクセスが少ないワークロードに。
・ストレージのコストをとにかく抑えたい場合などに。
-------------------------------------------------
