Elastic Compute Cloud// クラウド上のVM(Linux/Win)
-------------------------------------------------
// リサイズ可能な演算処理能力を提供
// 新規サーバインスタンスの起動時間が短い。
// 必要な演算能力要件に応じて増減双方スケーラブル。
-------------------------------------------------






EC2 の作成
-------------------------------------------------
削除保護の有効化
// 誤って削除しないよう、なんかしらやってくれる

ストレージの追加// つまりは、EBS の追加
// ボリューム →バーチャルHD
Root// OS を起動する場所
// ルートは ブートさせる場所なので、 Magnetic もしくは SSDにする。
ルートは、プロビジョニングが完了しない限り、暗号化できない。
// この AMI(Amazon Machine Image)をコピーして作成した場合、それは暗号化できる
// デフォルトで、EC2 インスタンス(VM)が削除されたら、
// アタッチされたボリュームも一緒に削除される、がチェックされている
EBS
// 追加のボリューム

タグの追加
// EC2 名、部署、チーム、作成者のスタッフID とか入れておくと便利

セキュリティグループの設定

EC2 インスタンスを作成し、走らせた後では、
ロールを追加できない
-------------------------------------------------








▼ 課金オプション
-------------------------------------------------
▼ On Demand
時間辺りで、FIX された料金を払う。
-------------------------------------------------
・前金なしかつ、長期契約なしで、柔軟性をもたせたいユーザー向け。
・短期間で、負荷が変動かつ予測不可能なアプリ。
そして、その変動を中止できないようなアプリ。
・EC2 で開発中もしくはテスト中のアプリ
-------------------------------------------------


▼ Reserved
-------------------------------------------------
1 - 3 年契約で、処理能力を予約する。結果安くなる。
使用するアプリの必要とする要件をきっちりわかっている必要がある。
-------------------------------------------------
・一定のペースで使用されており、負荷も予測可能
・キャパシティをリザーブしておきたい
・前金払可能なユーザー。そうして総費用を抑えるのです。
  Reserved Instance の種類
   - Standard RI(75% オフ)// On Demand との比較
   - Convertible RI(54% オフ)
   // 他の Convertible RI と交換できる。
   // ただし、交換対象は、同額もしくはより高額のもののみ。安いやつに交換できない。
   // Win →Linux
   // 一般のインスタンス →CPU 最適化インスタンスなどなどなど
   - Scheduled RI
   // 予約した時間内だけ、起動できる。
   // 日/週/月 の決まった時間だけ起動するとか、わかっている場合に有効
   // 毎月月末3日だけとか。
-------------------------------------------------


▼ Spot
-------------------------------------------------
需要に応じた価格変動性。欲しい能力に応じて入札する。
-------------------------------------------------
・開始 - 終了時間がフレキシブルなアプリ
・インスタンスを終了したら、1時間単位で支払う。30分で終了しても1時間ぶん。
・AWS が Spot インスタンスを終了したら、終了された時間帯は無料。Spot 料金が入札料金を超えた時など。

・処理に使える資金が限られているアプリ
・保険会社や遺伝子を取り扱う会社が、深夜の安い時間を狙って入札し、がっつりやるとか。
-------------------------------------------------


▼ Dedicated Hosts
-------------------------------------------------
あなた専用 EC2 物理サーバ。
ソフトウェアライセンスに紐付いたサーバを使うことで、コストを抑えられる。
オラクルサーバとかがある。
-------------------------------------------------
・マルチテナント（他の会社が間借りしている）サーバを使ってはいけない、などの規制要件がある場合
・時間あたりのオンデマンドで使うことも可能
・Reserved として使うことも可能（70% オフ)
-------------------------------------------------










▼ インスタンス タイプ// DR Mc GIFT PX ドクターｍC ギフト ピックス
-------------------------------------------------
D2// Dense Storage 二代目デンシティ
File Server、Data Warehousing, Hadoop

I2// High Speed Storage あいおぷすIOPS Input/Output per second 入出力パフォーマンス指標
NoSQL DB, Data Warehousing

R4// Memory Optimized 4代目RAM
Memory Intensive Apps/DBs

X1// Memory Optimized エクストリームRAM
SAP HANA/APACHE Spark
// SAP HANA →全てのデータをメモリー上に保有し、高速に処理するための企業向けインメモリーデータベース製品
// APACHE Spark →オープンソースの クラスター コンピューティングネットワーク

C4// Compute Optimized 4代目 コンピュート
CPU Intensive Apps/DBs

G2// Graphics Intensive
Video エンコーディング、3D アプリケーションストリーミング

P2// Graphics/General Purpose GPU  →Pics
機械学習やビットコインマイニングに使える GPU

F1// FIeld Programmable Gate Array
// FPGA。集積回路のうちのひとつ。製造後に設定変更可能
コードに合わせて集積回路の設定を変える Hardware acceleration

M4// General Purpose メインチョイス for 一般利用
アプリケーションサーバ

T2// Lowest Cost, General Purpose ティーペスト（チーペスト
ウェブサーバ。小規模 DB
-------------------------------------------------

















▼ web サーバを作ってみる
-------------------------------------------------
root ユーザーになる
// sudo su

セキュリティーのため、アップデートする
// yum update -y    //-y  →全部イエス！

アパッチインストール
// yum install httpd -y

適当な index.html を作る
// cd /var/www/html/
// vi index.html

httpd サービスをスタート
// service httpd start

ブラウザに EC2 のIP アドレスを入れれば、スタティックなサイトが表示されるはず
もしくは、
EC2 の パブリック DNS (IPv4) でも OK
// ec2-54-199-247-174.ap-northeast-1.compute.amazonaws.com
-------------------------------------------------







EC2 インスタンスページについて
-------------------------------------------------
▼ System Status Checks
ネットワークパケットが EC2 インスタンスに到達可能かどうかチェック。
つまり、インスタンスをホストしている
AWS のインフラ（電源、ネットワーク、ソフトウェア）の正常性チェックをしている

▼ Instance Status Check
インスタンスの OS がトラフィックを受け入れるかどうかのチェック
-------------------------------------------------
