ウェブサーバを冗長化するために。

▼ オートスケーリングインスタンスをローンチすると起きること
作成 ⇒
・それぞれの EC2 インスタンスがローンチする
・パブリック IP アドレスにアクセスすると、それぞれの ページが対象の index.html を立ち上げる
・ELB のトラフィックを受信していれば、



▼ オートスケーリング時の起動設定
-------------------------------------------------
EC2 > オートスケーリング > 起動設定

IAM ロール を設定

高度な詳細 から、ユーザー出たセクションに
ブートストラップ スクリプトを記載

後はデフォルトのままで問題はない
//そしてこの段階では、 EC2 インスタンスは作成されない
-------------------------------------------------







▼ AutoScaling グループの作成
-------------------------------------------------

▼スケーリンググループの詳細設定
-------------------------------------------------
// ・開始時 5 インスタンスにした
// ・冗長化をするためなので、サブネットには全ての AZ を選択


// ・ロードバランサーからトラフィックを受信
// ・ヘルスチェックのタイプ ⇒ELB     //ELB からヘルスチェックをされる対象になる
// ・ヘルスチェックの猶予   // ブートストラップで アパッチ等出来上がってからじゃないと失敗するし、猶予必要
-------------------------------------------------


▼ スケーリングポリシーの設定
-------------------------------------------------
オートスケーリンググループの作成
// ・1 - 5 インスタンスにした。
ステップスケーリングポリシーのリンクをクリック

▼ グループサイズの増加/減少
-------------------------------------------------
CPU 使用率の増減によって、対応するサーバを立ち上げたり、キルしたりをする
-------------------------------------------------
オートスケーリング開始のためのトリガーを設定
//  ⇒新しいアラームを追加
// ・通知の連絡先 チェックをはずした
// ・CPU 使用率 90% 以上でアラームとした
アクションを設定
・1 インスタンスを追加
・CPU 使用率 90% 以上の場合
・インスタンス追加インターバル 300 秒
-------------------------------------------------


▼ 通知の設定
タイトル と Email アドレス などを設定


▼ タグの設定
関係のある スタッフID とか 担当部署 とか入れておく
-------------------------------------------------
