ロールとは
-------------------------------------------------
ロールには標準の長期認証情報 (パスワードやアクセスキー) も関連付けられません。代わりに、ユーザーがロールを引き受けた場合、一時的セキュリティ認証情報が動的に作成され、ユーザーに提供されます。

たとえば、AWS アカウントのユーザーに、通常はないリソースへのアクセス権を付与したり、
ある AWS アカウントのユーザーに、別のアカウントのリソースへのアクセス権を付与したりできます。


フェデレーション
// 外部 ID プロバイダーと AWS との間に信頼関係を作成すること


信頼ポリシー
// ロールを引き受けるユーザーを定義する JSON 形式のドキュメント。
// この信頼されたエンティティは、ドキュメントのプリンシパル要素として、ポリシーに含まれています。


プリンシパル
アクションを実行してリソースにアクセスできる AWS 内のエンティティ
AWS アカウントのルートユーザー、IAM ユーザー、またはロールをプリンシパルにすることができます。


スイッチロール
// 機密性の高いリソースに誤ってアクセスしたり変更したりすることを回避するのに役立ち
-------------------------------------------------


▼ 一時的セキュリティ認証情報
-------------------------------------------------
STS //Security Token Service
AWS リソースへのアクセスを制御できる、一時的セキュリティ認証情報を持つ、信頼されたユーザーを作成

・IAM ユーザーの、長期的認証情報とほぼ同じ
・有効期間が短い
・認証情報のローテート等しなくていい
・ユーザーのリクエストに応じて動的に生成、提供される
-------------------------------------------------


▼ 各 API の説明
https://docs.aws.amazon.com/ja_jp/IAM/latest/UserGuide/id_credentials_temp_request.html
-------------------------------------------------
API オプションの呼び出し元の違い
AssumeRole：	IAM ユーザー、または既存の一時的なセキュリティ認証情報を持つユーザー
AssumeRoleWithSAML：既知の ID プロバイダーからの認証を示す SAML 認証レスポンスを渡す任意のユーザー。
AssumeRoleWithWebIdentity	：既知の ID プロバイダーからの認証を示す ウェブ ID トークンを渡す任意のユーザー。
-------------------------------------------------
API オプションの一時的な認証情報に対する制限のち外
GetFederationToken：
・IAM API オペレーションを直接呼び出せません。
コンソールへの シングルサインオン (SSO) は許可されています

GetSessionToken：
・リクエストに MFA 情報が含まれていない場合は、IAM API オペレーションを呼び出せません。
コンソールへの SSO は許可されませんが、パスワードを持っているルートまたは IAM ユーザーはコンソールにサインインできます。
-------------------------------------------------






AssumeRole
-------------------------------------------------
"通常時には使えないAWSリソース"へのアクセスに使う、一時的なセキュリティ資格情報を返す。
返ってくる temporary credentials は、アクセスキーID、シークレットアクセスキー、セキュリティトークンからなる。
典型的な使用シーン
// 別アカウントへのアクセスや、フェデレーション


アプリケーションとサービスへのアクセスを許可する（つまり、外部フェデレーションユーザー）など、
ロールを複雑な方法で使用するには、AssumeRole API を呼び出します。
アプリケーションは、ユーザーがコンソールで行った方法でロールを "終了" する必要はありません。
アプリケーションは一時的な認証情報を使用して停止し、元の認証情報で呼び出しを再開するだけです。
-------------------------------------------------
https://sts.amazonaws.com/
?Version=2011-06-15
&Action=AssumeRole
// セッションの識別に使用できる文字列。CloudTrail によって記録され、監査中のロールユーザーの区別に使える
&RoleSessionName=Bob
// アプリが引き受ける必要のあるロールの Amazon リソースネーム (ARN)
&RoleArn=arn:aws::iam::123456789012:role/demo
// ポリシー（JSON 形式）
&Policy=%7B%22Version%22%3A%222012-10-17%22%2C%22Statement%22%3A%5B%7B%22Sid%22%3A%20%22Stmt1%22%2C%22Effect%22%3A%20%22Allow%22%2C%22Action%22%3A%20%22s3%3A*%22%2C%22Resource%22%3A%20%22*%22%7D%5D%7D
// 一時的なセキュリティ認証情報の期間を指定。指定しない場合、1時間有効
&DurationSeconds=1800
// サードパーティーにアカウントへのアクセス権を委任するときに使用できるオプションの ExternalID 値。この値を利用して、指定されたサードパーティーだけがロールにアクセスできるようにします。
&ExternalId=123ABC
//  (MFA) を使用するように設定されている場合、MFA デバイスの ID と、このデバイスによって提供されるワンタイムコード
&AUTHPARAMS
-------------------------------------------------
