Aurora
-------------------------------------------------
スピードと可用性の高い ハイエンドなコマーシャル DB と
シンプルで 値段もお手頃な オープンソース DB の利点を合わせた RDB エンジン

パフォーマンス ⇒MySQL の 最大5倍。市販のDBと同じくらいのパフォーマンスと可用性
価格 ⇒市販のDBの 1/10

AWS でのみインストール可能

MySQL と互換性があるので、
MySQL の DB を Aurora 上で走らせることも、Aurora にインポートすることも容易
-------------------------------------------------


▼ スケーリング
-------------------------------------------------
・容量スケール
10GB から 10GB ずつ増やせて、64TB までオートスケール

・Compute リソース
スケールする際 数分の ダウンタイムが生じる
最大 32vCPU   244 GB メモリ

・少なくとも 3 つの AZ に、それぞれ データのコピーが 2 つずつ作られる。
合計 6 つのデータコピーが生成されることになる。
・コピー2つまでは ロスト しても 書き込み処理に影響しない
     3つまでは ロスト しても読み込み処理に影響しない

・データブロックとディスクが継続的にスキャンされ、エラーがあれば自動修復される
-------------------------------------------------



▼ Aurora Replica
-------------------------------------------------
・Aurora Replica
オリジナルとは別のレプリカ。15 個まで。
フェイルオーバーが自動に起きる
// クラスターエンドポイント がフェイルしたら、インスタンスエンドポイント にフェイルオーバーする
// アマゾンが、自動的にエンドポイントを付け替える。    試験には出ない

・MySQL Read Replica
5 個まで
フェイルオーバーがは手動
-------------------------------------------------
