▼ 用語
-------------------------------------------------
エンドポイント
// DB における ネットワークアドレス。アプリはエンドポイントを使ってDBインスタンスに接続する。
// アクセス制御には セキュリティグループ を使う。
-------------------------------------------------


▼ 要件
-------------------------------------------------
 - リソース要件
   - メモリとプロセッサの要件// インスタンスタイプ

 - VPC, サブネット, セキュリティグループ
-------------------------------------------------


▼ OLTP vs OLAP
-------------------------------------------------
Online "Transaction" Processing
Online "Analytics" Processing

OLTP 例
SELECT * FROM db WHERE _id=233232323;
データの row から 顧客名や配送状況 などを引き出す

OLAP 例
村田製作所 と Sony の センサーの総利益を、アジア地域と北米地域とで抽出
各地域の売上数、単価、ユニットコストなどを引き出して、処理して出す
-------------------------------------------------



▼ RDS と DynamoDB との違い
-------------------------------------------------
DynamoDB
// ・ダウンタイム無しでスケールできる。  push button スケーリングとも言う
// ・コラムをアイテムごとに柔軟に追加削除できる

RDS
// ・手動でサイズを大きくした上で、スケールすることになる。
// RDS がスケールするには、リードレプリカ作成時やスナップショット作成時に
// より大きいインスタンスサイズを使う必要がある。

DynamoDB への移行を考慮するケース
・リードレプリカによるスケールに限界が見えてきた時
・ダウンタイム無しでスケールしたいと判断した時
-------------------------------------------------








▼ DMS // Database Migration Service
-------------------------------------------------
マイグレーション処理時に、データタイプの変換、圧縮、パラレル転送 を管理する
マイグレーション中のソースDBへの変更も、ターゲットにレプリケートされる。

SCT // Schema Conversion Tool
ソースのスキーマと、カスタムコードの大部分（view, stored procedure, function) を
ターゲットのフォーマットに変換

Oracle など、ライセンス料の高い DB から MySQL や Aurora といった無料の DB に変換できる。
-------------------------------------------------
