▼ RDS と DynamoDB との違い
-------------------------------------------------
DynamoDB
// ・ダウンタイム無しでスケールできる。  push button スケーリングとも言う
// ・コラムをアイテムごとに柔軟に追加削除できる

RDS
// ・手動でサイズを大きくした上で、スケールすることになる。
// RDS がスケールするには、リードレプリカ作成時やスナップショット作成時に
// より大きいインスタンスサイズを使う必要がある。

DynamoDB への移行を考慮するケース
・リードレプリカによるスケールに限界が見えてきた時
・ダウンタイム無しでスケールしたいと判断した時
-------------------------------------------------








▼ DMS // Database Migration Service
-------------------------------------------------
マイグレーション処理時に、データタイプの変換、圧縮、パラレル転送 を管理する
マイグレーション中のソースDBへの変更も、ターゲットにレプリケートされる。

SCT // Schema Conversion Tool
ソースのスキーマと、カスタムコードの大部分（view, stored procedure, function) を
ターゲットのフォーマットに変換

Oracle など、ライセンス料の高い DB から MySQL や Aurora といった無料の DB に変換できる。
-------------------------------------------------
