▼ Elasticache
-------------------------------------------------
読み込みによる負荷が高い場合 ⇒Elasticache
OLAP による DB 負荷が高い場合 ⇒Redshift



DB サーバからクエリした結果を
クラウド上の in-memory にキャッシュする。
ディスクアクセスよりずっと速い

キャッシュ対象
・データクエリの結果
・computationally-intensive な計算結果


ユースケース
・読み込みの多いアプリの workload。SNS、ゲーム
・DB の変更が頻繁じゃない場合
・計算処理の集中する workload レコメンドエンジンとか
・人気Top10製品のデータをここに格納しておくとか。
結果、元のDBは他の事に処理能力を使える
-------------------------------------------------



サポートしている in-memory キャッシュエンジン
・Memcached
-------------------------------------------------
DB ドリブンなwebサイト のパフォーマンスを上げるのに使われる。
RAM にデータやオブジェクトをキャッシュしてる。
ElasticCache は Memcached のプロトコルに準拠している

マルチ AZ はサポートしてない
-------------------------------------------------


・Redis
-------------------------------------------------
key/value をキャッシュ
Set や List のデータ構造をサポート
マスター/スレーブ レプリケーション、マルチ AZ をサポート
-------------------------------------------------
