▼ RedShift
-------------------------------------------------
とても安くて人気のサービス

・ペタバイトを扱える
・Data warehousing


ユースケース
OLAP に使う。JOIN をたくさん使ったりと、複雑なクエリに使える。今期の利益を計算とか。
-------------------------------------------------



▼ シングル/マルチノード
-------------------------------------------------
シングルノード
// 160GB
負荷や可用性の観点から、こちらでよければこちらでよい

マルチノード
・リーダーノード
// クライアントの接続を、コンピュートノードに割り振るなどで管理し、クエリを受け取る
・コンピュートノード
// 128 ノードまで
// データを格納し、クエリを実行し、計算を行う

-------------------------------------------------





▼ Columnar データ・ストレージ
-------------------------------------------------
row でデータを格納するのではなく、
コラムによってデータを構成させる。

row-based system
トランザクション 処理に強い
// データベース管理システム内で実行される、分けることのできない一連の情報処理の単位

column-based system
・大量のデータを aggregate するクエリ処理を行うなど、OPLA に強い
// クエリ対象のコラムだけに処理が行われる。隣接するコラムは使わない。
// コラムのデータは シークエンシャル にストレージに格納される
 // ⇒トランザクションプロセスに比べ、遥かにI/O が少なく、クエリのパフォーマンスがいい
-------------------------------------------------



▼ Advanced Compression
-------------------------------------------------
row-based と比べ、 column-based system は圧縮率が高い ⇒だから速い
// 似たデータがシークエンシャルにディスク格納されるため
// Redshift は インデックスや materialized view を必要としないため、データの量が少ない

空のテーブルにデータをロードする際、
Redshit は自動的にデータサンプリングを行って、最適な圧縮スキームを適用する
-------------------------------------------------



▼ Massive Parallel Processing (MPP)
-------------------------------------------------
Redshift は クエリ等の負荷を全ノードに自動的に割り振る。
データウェアハウジングへのノードの追加も簡単。
-------------------------------------------------





▼ 課金対象
-------------------------------------------------
1.コンピュートノードに対する時間課金
・リーダーノードには課金されない

1.バックアップ
1.VPC 内データ転送

課金プラン
// $0.25/hour
// $1000/terabyte/year
-------------------------------------------------



▼ セキュリティ
-------------------------------------------------
トランジット時:SSL
非アクティブデータ:AES-256
鍵マネジメント
・自身のキーはHSM または AWS KMS で管理 // Hardware Security Module
-------------------------------------------------


▼ 可用性
-------------------------------------------------
・AZ は1つのみ。// データウェアハウジング なので、ユーザーが常にアクセスするようなものではない
・スナップショットから他の AZ に復元可能

-------------------------------------------------









▼ Data Warehousing
-------------------------------------------------
・ビジネスインテリジェンス で使う。
// Cognos, Jaspersoft SQL Server Reporting Services, Oracle Hyperion, SAP NetWeaver

・個々の row ではなく、Column を扱う処理と考えるといい
// 異なるデータリソースをまとめるレポジトリ。

・大量で複雑なデータを取り扱って、あるターゲットに対する現在のパフォーマンス、などのデータを引き出す

・Data Warehousing を行うための環境
// ・Production データベースでは、盛んに I/O がなされている。
// なので、解析時には、
// Production DB のコピーを取得し、それに対して OLAP 処理を行う。

クエリ時間を短くするために
DB の面でも、インフラの面でも、異なるタイプのアーキテクチャーが必要。
例えば、Columnレスストレージ
-------------------------------------------------
