・__name__
# 現在のモジュール名を意味する組み込み変数

・__main__
スクリプトを直接実行したとき
# python mainModule.py のように、モジュールを直接は知らせたとき
そのスクリプトファイルのモジュール名は __main__ として認識される
# mainModule ではなく。


▼ モジュール内で実装されている関数を知る
-------------------------------------------------
# モジュール内で実装されている関数がわかる
print(dir(math))
-------------------------------------------------

▼ 関数のヘルプを出す
-------------------------------------------------
# 関数のヘルプ
help(math.ceil)
-------------------------------------------------



▼ スクリプトをコールする際の引数を、関数内で使用
-------------------------------------------------
%%writefile file3.py
import sys
import createEvenNum

# [0] は、対象ファイル file3.py に対応している
num = int(sys.argv[1])
print(createEvenNum.createEvenNum(num))

# 下記例の 21 を使用できる
# ! python file3.py 21
-------------------------------------------------
