▼ スナップショットのとり方
-------------------------------------------------
対象 EC2 インスタンスを停止
 ⇒ボリュームページ＞アクション＞スナップショットを取る
-------------------------------------------------


▼ スナップショットでできること
-------------------------------------------------
コピーを作成
// ・リージョンを変更可能
// ・暗号化可能

スナップショットを元に AMI 作成
// アクション＞イメージ作成

暗号化されたボリュームのスナップショットは、自動的に暗号化される
暗号化されたスナップショットから復元さればボリュームも、自動的に暗号化される

・スナップショットを共有できる。
 - ただし、暗号化されていない場合に限る。なぜなら、暗号化キーは AWS アカウントに紐付いているから。
 - スナップショットは、他の AWS アカウントと共有できるし、パブリックにもできる
-------------------------------------------------



スナップショット削除制限
-------------------------------------------------
EBS ボリュームのスナップショットのうち、AMI のルートデバイスとして使われているものは、
AMI の登録を解除しない限り削除できない
-------------------------------------------------


▼ RAID// Redundant Array of Independent Disks
-------------------------------------------------
使い所
disk IO が 最大容量のボリュームを使っても要件に達しない時、RAID 化で改善できる。
複数のディスクをまとめて、一つのディスクのように扱う
AWS では、多くの場合 RAID0 か RAID10

RAID0
複数のディスクを一つのディスクとして扱う。
ゲームPCとかに多い。
冗長化なし。パフォーマンスよし。
一つのディスクが壊れたら、全部がダメになる

RAID1
ミラー化。冗長化。
一つのディスクのコピーがもう一つ。

RAID5
読み込みはよし。書き込みは悪し。AWS は EBS をこうすることを非推奨。

RAID10
RAID1 と RAID0 とが合体した感じ。
合体したものをミラー化。冗長化され、かつパフォーマンスもよし。
-------------------------------------------------










▼ RAID アレイのスナップショットのとり方
-------------------------------------------------
問題
スナップショットというものの特徴
・スナップショット時は、キャッシュが除外される（アプリやOS のキャッシュ）
・シングルボリュームでは問題ない
・RAID アレイは複数のボリュームから成っている。
・RAID アレイ内の、各ボリュームの相互依存のために、キャッシュ除外が問題となってくる

解決策
・アプリケーション consistent スナップショットをとる

方法
・アプリのディスクへの書き込みを止める
・キャッシュをディスクに flush する
上記を行う方法は以下のうちのどれでもよい
・ファイルシステムをフリーズ
・RAID アレイをアンマウント
・紐付いた EC2 インスタンスをシャットダウン//一番カンタン
 ⇒スナップショットをとる ⇒再起動
-------------------------------------------------
















▼ RDP の実験のため、Windows へのアクセス
-------------------------------------------------
RDP に MyIP からアクセスできるセキュリティルールを用意

ストレージがデフォルトで ３０GB（無料枠限界）のため
追加のストレージにはお金がかかる。ここでは デフォルトのやつを 4 つ追加

RDP の準備
UserName:administrator
パスワード
EC2 のインスタンス画面＞アクション＞パスワードの取得
CzUsdW4K3WWnRXrcn%FFpx8ISI(($?!G

パブリック DNS
ec2-54-178-10-63.ap-northeast-1.compute.amazonaws.com

RDP の立ち上げ
Windows+R ⇒ mstsc
// MicroSoft Tunnel Service Client

Administrator アカウントでログイン
-------------------------------------------------


▼ RDP にて、アタッチされた EBS をデタッチ ⇒RAID0化
-------------------------------------------------
以下、追加 EBS を RAID 化するポチポチ工程
// スタートメニュー を右クリック
// DiskManagement を選択
// ここで、
// アタッチした各ボリュームを Delete Volume していく
// さらに右クリック
// ストライプボリューム(RAID0)を作成
// Available な全ボリュームを Add していく
// 次へ ⇒デフォルトのドライブ割当で次へ ⇒
// Perform a quick format ⇒Finish
-------------------------------------------------
