Coding bat

monkey_trouble


文銭 2750
砂金 1400
小判 1400


サラダチキン
-------------------------------------------------
(つくりやすい分量)

・鶏むね肉 （皮なし） 1枚（300g）
・塩 小さじ1/2
・オリーブ油 大さじ2
・顆粒（かりゅう）スープの素（もと） （洋風） 小さじ1
・おろしにんにく （チューブタイプ） 小さじ1/2
・レモン汁 大さじ1
・黒こしょう （粗びき） 小さじ1/2
-------------------------------------------------
つくり方
1
鶏むね肉の全体をフォークで刺し、大きめの耐熱ボウル（直径25cm）に入れる。

2
ヒタヒタの水と塩を加え、ふんわりとラップをして電子レンジ（600W）に約8分間かける。
そのまま粗熱を取り、水けをきって1cmのそぎ切りにする。

3
ジッパー付き保存袋に、オリーブ油、顆粒スープの素、おろしにんにく、レモン汁、黒こしょうを入れて混ぜる。
鶏肉を加え、袋の上からもんで全体をなじませる。

! ポイント
2時間後から食べられる。
-------------------------------------------------

-------------------------------------------------
サラダチキンの材料 (作りやすい分量で)
鶏むね肉　…　1枚（300～400ｇ）
酒　…　50ml（大さじ3と1/3）
水　…　50ml（大さじ3と1/3）
砂糖　…　大さじ1/2
塩　…　小さじ1
生姜のしぼり汁　…　小さじ1ほど
レモン果汁　…　くし切り1切れ分
おろしにんにく　…　少々
こしょう　…　少々
加熱時追加分として…酒と水を各大さじ1ずつ
※鶏むね肉2枚で作る場合の調味料に関しては最下部の補足にまとめています。
-------------------------------------------------
サラダチキンの味付けについて
はじめにボウルにAの調味料類を混ぜ合わせます。以下ににんにく、生姜、こしょうに関しての注意点をまとめます。

・にんにくはほんの少しでOKです（チューブで言えば0.3～0.5㎝分ほどで）
・生姜は10ｇ弱を皮ごとすりおろして、しぼり汁だけを加えます（生の生姜が香りもよいのでおすすめ）
・こしょうは好みでたっぷり使用してもよいです


※市販品のように化学調味料や酵母エキス、香料などを使うわけではないので、家庭でそろえやすい、味に厚みを出したり香り付けをするもの（レモン、にんにく、生姜）は入れたほうが美味しくなります。はじめて作る場合はぜひ全部そろえてみてください（ただ、レモンとにんにくは必須ではないです。なければないでも美味しくできます）。

Aの中には水と酒も入っているので、すべてボウルに合わせたらよく混ぜ合わせます。


サラダチキンの胸肉に下味をつける
鶏むね肉は皮を除き、余分な脂が多くついていれば取り除きます（大きさは300～400ｇとしていますが、ある程度幅があっても問題なく作れます）。

つづいて、下味が入りやすいように金串や竹串、爪楊枝などを使って両面を突きます。※できるだけ串の先端の細いものがおすすめ


※先端が細い串を使ったほうが切ったときの断面がきれいです。私は細めの串で片面40～50回ずつくらい突いています。

下ごしらえのできた鶏むね肉をビニール袋に入れ、先に用意したAをすべて加えます。

空気が入らないように封をして、冷蔵庫に移して半日から1日ほど置いて味をなじませます。味をなじませた後に加熱します。


※2枚同時に作る場合でも、一つのビニール袋に入れて大丈夫です。

サラダチキンの火の通し方/レシピ
味をなじませた鶏むね肉は、汁ごと蓋ができる鍋に移します（鍋サイズは大きすぎないほうがよいです）。

ここで、加熱時に飛ぶ水分を補う目的で、酒と水を各大さじ1ずつ追加で加えます。


※上の写真では冷蔵庫に余っていた長ねぎの青い部分を入れています。これはあれば入れるくらいでOKです。なければ省いてください。

鍋を弱めの中火にかけ、蓋をして加熱し沸騰を待ちます。

沸騰したら弱火にして、蓋をしたまま5分間ことことと蒸らし煮します。


※沸騰時にアクが出てきますが、特に除かなくてOKです（煮汁が減ると火通りや味に影響が出るので）。

5分たったら、蓋をはずして上下を反転させます。再び蓋を戻して5分間蒸らし煮します。


合計10分後に火から外して、蓋をしたまま冷まします（余熱でも鶏肉にじんわり火が通ります）。

粗熱が取れて冷めたころに鶏肉の中央を指でさわってみてください。しっかり弾力があれば芯まで火が通った証拠です。そうなれば、保存容器に汁ごと移します。


自家製サラダチキンの保存と食べ方
冷めてから汁ごと保存容器に入れたサラダチキンは冷蔵庫で3日ほど、冷凍すれば1か月ほどが保存の目安となります。

※冷凍する場合は、汁ごとそのまま冷凍してもいいですし、さっと食べたい場合などは食べやすい幅にカットしてからラップに広げて冷凍するなどしても。


食べるときは食べやすい4～5㎜幅くらいに切るなどします。器に盛り付けて、まずはシンプルに残ったサラダチキンの汁をかけたり、オリーブオイルやマヨネーズをかけたりしていただきましょう。


他の食べ方としては、切ったものを具材の一つとして、生食のサラダや和え物、冷やし中華などの具材として使うのはもちろん、炒め物の具として加熱して食べるのも美味しいです。


【補足】
鶏むね肉2枚で作る場合は、下味用の調味料(A)は各2倍にして仕込み、加熱時に追加する酒と水はそのまま大さじ1ずつでOKです（そんなに水分飛ばないので）。下味をなじませる時間や加熱時間は1枚の時と変わらずで。
加熱するときはフライパンでもよいのですが、浅すぎると蓋がきちんとできなかったり、大きすぎると余分に水分が蒸発して蒸らし煮が10分できなかったりするので、様子を見ながら行ってみてください。
竹串や爪楊枝にも太さがさまざまあるので、家にあるいちばん細めの串を下ごしらえに使うとよいです
-------------------------------------------------
