Exam Tips
-------------------------------------------------
標準モニタリング: 5min
詳細モニタリング: 1min

アラーム
閾値を超えたら通知できる

イベント
状態変化をイベントとして発火できる。
それを他の AWS コンポーネントで利用できる
-------------------------------------------------


メトリクスの種類
-------------------------------------------------
CPU 系、 Disk 系、 Network 系、
ステータスチェック系
 - インスタンスレベル//VM
 - システムレベル//ホストレベル VM を走らせてる ハイパーバイザーの状態
 -------------------------------------------------
 メトリクスにないもの ⇒カスタマイズすれば使える。
 RAM、EBS ボリュームなど
 -------------------------------------------------


▼ Cloud Watch と Trail との違い
-------------------------------------------------
 Cloud Watch
 CPU の状況などをモニタリングする

 Cloud Trail
 AWS 全体の 監査。
 ユーザー作成、S3バケツ 作成などをモニタリング
 -------------------------------------------------
