１:15 から

ケーススタディ
開発会社
150 人の従業員、40 人の開発者

hosting/Saas モデルへ移行したい。
ロングターム
Saas 環境内でプロビジョニングを自動化したい

ショートタイム自動化要件
テスト
プリセールス



現状
-------------------------------------------------
開発者:
GitHub を利用
チェックアウト →1,3日かけて フィーチャーを作成 →レポジトリにプッシュ
フィーチャーブランチを使わず、全部マスターブランチでやってる

現状、インテグレーション HELL
インテグレーションテストはなされていない。
テストチームによるメジャーテストには 1－3 日 かかる

テストチーム:
1－3 日ごとに、GitHub からコードをダウンロード →テスト環境

オンプレミスのテスト環境
3 のサーバ
1.既存のサーバで旧バージョンの残りの？バージョンテストを行う
2.依存関係を反映させたサーバをリビルドする

プリセールス:
時間かかる
-------------------------------------------------



理想
-------------------------------------------------
GitHub にプッシュ →即同期 →半自動テスト

CFn コードもGitHub
プッシュされたバージョンのためのテスト環境を、
CFn コードが自動構築
不要になったら削除。

プリセールスチーム
顧客の要望に従って、指定のバージョンの環境をコンソールから簡単構築。

-------------------------------------------------
